STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_sd.c
            Csd->EraseSingleBlockEnable = (CSD_Tab[10] & 0x40) >> 6;
            Csd->EraseSectorSize   = ((CSD_Tab[10] & 0x3F) << 1)
                                     |((CSD_Tab[11] & 0x80) >> 7);
            Csd->WrProtectGrSize   = (CSD_Tab[11] & 0x7F);
            Csd->WrProtectGrEnable = (CSD_Tab[12] & 0x80) >> 7;
            Csd->Reserved2         = (CSD_Tab[12] & 0x60) >> 5;
            Csd->WrSpeedFact       = (CSD_Tab[12] & 0x1C) >> 2;
            Csd->MaxWrBlockLen     = ((CSD_Tab[12] & 0x03) << 2)
                                     |((CSD_Tab[13] & 0xC0) >> 6);
            Csd->WriteBlockPartial = (CSD_Tab[13] & 0x20) >> 5;
            Csd->Reserved3         = (CSD_Tab[13] & 0x1F);
            Csd->FileFormatGrouop  = (CSD_Tab[14] & 0x80) >> 7;
            Csd->CopyFlag          = (CSD_Tab[14] & 0x40) >> 6;
            Csd->PermWrProtect     = (CSD_Tab[14] & 0x20) >> 5;
            Csd->TempWrProtect     = (CSD_Tab[14] & 0x10) >> 4;
            Csd->FileFormat        = (CSD_Tab[14] & 0x0C) >> 2;
            Csd->Reserved4         = (CSD_Tab[14] & 0x03);
            Csd->crc               = (CSD_Tab[15] & 0xFE) >> 1;
            Csd->Reserved5         = (CSD_Tab[15] & 0x01);

            retr = MSD_OK;
        }
    }

    /* Send dummy byte: 8 Clock pulses of delay */
    SD_IO_CSState(1);
    SD_IO_WriteByte(SD_DUMMY_BYTE);

    /* Return the response */
    return retr;
}

/**
  * @brief  Reads the SD card CID register.
  *         Reading the contents of the CID register in SPI mode is a simple
  *         read-block transaction.
  * @param  Cid: pointer on an CID register structure
  * @retval SD status
  */
uint8_t SD_GetCIDRegister(SD_CID* Cid)
{
    uint32_t counter = 0;
    uint8_t retr = BSP_SD_ERROR;
    uint8_t CID_Tab[16];
    SD_CmdAnswer_typedef response;

    /* Send CMD10 (CID register) and Wait for response in the R1 format (0x00 is no errors) */
    response = SD_SendCmd(SD_CMD_SEND_CID, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
    if(response.r1 == SD_R1_NO_ERROR)
    {
        if(SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == MSD_OK)
        {
            /* Store CID register value on CID_Tab */
            for (counter = 0; counter < 16; counter++)
            {
                CID_Tab[counter] = SD_IO_WriteByte(SD_DUMMY_BYTE);
            }

            /* Get CRC bytes (not really needed by us, but required by SD) */
            SD_IO_WriteByte(SD_DUMMY_BYTE);
            SD_IO_WriteByte(SD_DUMMY_BYTE);

            /* Byte 0 */
            Cid->ManufacturerID = CID_Tab[0];

            /* Byte 1 */
            Cid->OEM_AppliID = CID_Tab[1] << 8;

            /* Byte 2 */
            Cid->OEM_AppliID |= CID_Tab[2];

            /* Byte 3 */
            Cid->ProdName1 = CID_Tab[3] << 24;

            /* Byte 4 */
            Cid->ProdName1 |= CID_Tab[4] << 16;

            /* Byte 5 */
            Cid->ProdName1 |= CID_Tab[5] << 8;

            /* Byte 6 */
            Cid->ProdName1 |= CID_Tab[6];

            /* Byte 7 */
            Cid->ProdName2 = CID_Tab[7];

            /* Byte 8 */
            Cid->ProdRev = CID_Tab[8];

            /* Byte 9 */
            Cid->ProdSN = CID_Tab[9] << 24;

            /* Byte 10 */
            Cid->ProdSN |= CID_Tab[10] << 16;

            /* Byte 11 */
            Cid->ProdSN |= CID_Tab[11] << 8;

            /* Byte 12 */
            Cid->ProdSN |= CID_Tab[12];

            /* Byte 13 */
            Cid->Reserved1 |= (CID_Tab[13] & 0xF0) >> 4;
            Cid->ManufactDate = (CID_Tab[13] & 0x0F) << 8;

            /* Byte 14 */
            Cid->ManufactDate |= CID_Tab[14];

            /* Byte 15 */
            Cid->CID_CRC = (CID_Tab[15] & 0xFE) >> 1;
            Cid->Reserved2 = 1;

            retr = MSD_OK;
        }
    }

    /* Send dummy byte: 8 Clock pulses of delay */
    SD_IO_CSState(1);
    SD_IO_WriteByte(SD_DUMMY_BYTE);

    /* Return the response */
    return retr;
}

/**
  * @brief  Sends 5 bytes command to the SD card and get response
  * @param  Cmd: The user expected command to send to SD card.
  * @param  Arg: The command argument.
  * @param  Crc: The CRC.
  * @param  Answer: SD_ANSWER_NOT_EXPECTED or SD_ANSWER_EXPECTED
  * @retval SD status
  */
SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer)
{
    uint8_t frame[SD_CMD_LENGTH], frameout[SD_CMD_LENGTH];
    SD_CmdAnswer_typedef retr = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

    /* R1 Length = NCS(0)+ 6 Bytes command + NCR(min1 max8) + 1 Bytes answer + NEC(0) = 15bytes */
    /* R1b identical to R1 + Busy information                                                   */
    /* R2 Length = NCS(0)+ 6 Bytes command + NCR(min1 max8) + 2 Bytes answer + NEC(0) = 16bytes */

    /* Prepare Frame to send */
    frame[0] = (Cmd | 0x40);         /* Construct byte 1 */
    frame[1] = (uint8_t)(Arg >> 24); /* Construct byte 2 */
    frame[2] = (uint8_t)(Arg >> 16); /* Construct byte 3 */
    frame[3] = (uint8_t)(Arg >> 8);  /* Construct byte 4 */
    frame[4] = (uint8_t)(Arg);       /* Construct byte 5 */
    frame[5] = (Crc | 0x01);         /* Construct byte 6 */

    /* Send the command */
    SD_IO_CSState(0);
    SD_IO_WriteReadData(frame, frameout, SD_CMD_LENGTH); /* Send the Cmd bytes */

    switch(Answer)
    {
    case SD_ANSWER_R1_EXPECTED :
        retr.r1 = SD_ReadData();
        break;
    case SD_ANSWER_R1B_EXPECTED :
        retr.r1 = SD_ReadData();
        retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        /* Set CS High */
        SD_IO_CSState(1);
        HAL_Delay(1);
        /* Set CS Low */
        SD_IO_CSState(0);

        /* Wait IO line return 0xFF */
        while (SD_IO_WriteByte(SD_DUMMY_BYTE) != 0xFF);
        break;
    case SD_ANSWER_R2_EXPECTED :
        retr.r1 = SD_ReadData();
        retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        break;
    case SD_ANSWER_R3_EXPECTED :
    case SD_ANSWER_R7_EXPECTED :
        retr.r1 = SD_ReadData();
        retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        retr.r3 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        retr.r4 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        retr.r5 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        break;
    default :
        break;
    }
    return retr;
}

/**
  * @brief  Gets the SD card data response and check the busy flag.
  * @retval The SD status: Read data response xxx0<status>1
  *         - status 010: Data accepted
  *         - status 101: Data rejected due to a crc error
  *         - status 110: Data rejected due to a Write error.
  *         - status 111: Data rejected due to other error.
  */
uint8_t SD_GetDataResponse(void)
{
    uint8_t dataresponse;
    uint8_t rvalue = SD_DATA_OTHER_ERROR;

    dataresponse = SD_IO_WriteByte(SD_DUMMY_BYTE);
    SD_IO_WriteByte(SD_DUMMY_BYTE); /* read the busy response byte*/

    /* Mask unused bits */
    switch (dataresponse & 0x1F)
    {
    case SD_DATA_OK:
        rvalue = SD_DATA_OK;

